Revit 2027 API
View.HasViewTransforms Method
 Returns true if the view reports model space to view projection space transforms.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasViewTransforms()
Public Function HasViewTransforms As Boolean
public:
bool HasViewTransforms()
member HasViewTransforms : unit -> bool
Return Value
Boolean
 True if the view returns transforms, false otherwise.
Remarks
 Not all views return transforms. For example, schedules and legends do not report transforms.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace